Tekla Open API Reference for Tekla Structures 2025
Events.DrawingStatusChangedDelegate Delegate
 The delegate to use for drawing status change.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void DrawingStatusChangedDelegate()
Public Delegate Sub DrawingStatusChangedDelegate
See Also
Reference
Tekla.Structures.Drawing Namespace